app/controllers/books_controller.rb

  def index
    @books = Book.all
    @newbook = Book.new
    @user = current_user
    @users = User.all
---
SELECT "books".* FROM "books"
SELECT "users".* FROM "users"

  def create
    @newbook = Book.new(book_params)
    @newbook.user_id = current_user.id
    if @newbook.save
      redirect_to book_path(@newbook.id), notice:'You have creatad book successfully.'
    else
      @newbook.errors.full_messages
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aaaaaaaaaaaaaa"], ["body", "ggggggggggggg"], ["user_id", 1], ["created_at", "2020-06-22 05:42:00.520138"], ["updated_at", "2020-06-22 05:42:00.520138"]]
SELECT "books".* FROM "books"