app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Merumeru"], ["introduction", "skate"], ["profile_image_id", "d27c34ca2c66d3c6e3c4a1dbdcaf4b0b22abbc52b0a7c868facdc9f93a37"], ["updated_at", "2020-06-22 06:48:23.676826"], ["id", 2]]